openfoam/lisn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          128;
        startFace       55870;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       55998;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       56062;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17036;
        startFace       56126;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8331;
        startFace       73162;
    }
)

// ************************************************************************* //
